import os

class Config:
    DB_NAME = os.getenv("DB_NAME", "flight-data")
    DB_USER = os.getenv("DB_USER", "flight-database-user")
    DB_PASSWORD = os.getenv("DB_PASSWORD", "$secret$")
    DB_HOST = os.getenv("DB_HOST", "localhost")
    DB_PORT = os.getenv("DB_PORT", "5432")

    # Base URL for the flight information system
    BASE_URL = "https://fids.airport.ir/"

    # List of airports with name and URL
    AIRPORTS = [
        {"name": "فرودگاه مهرآباد", "url": "/2/اطلاعات-پرواز-فرودگاه-مهرآباد"},
        {"name": "فرودگاه مشهد", "url": "/102/اطلاعات-پرواز-فرودگاه-مشهد"},
        {"name": "فرودگاه شيراز", "url": "/1/اطلاعات-پرواز-فرودگاه-شيراز"},
        {"name": "فرودگاه تبريز", "url": "/103/اطلاعات-پرواز-فرودگاه-تبريز"},
        {"name": "فرودگاه اصفهان", "url": "/114/اطلاعات-پرواز-فرودگاه-اصفهان"},
        {"name": "فرودگاه اهواز", "url": "/401/اطلاعات-پرواز-فرودگاه-اهواز"},
        {"name": "فرودگاه بوشهر", "url": "/104/اطلاعات-پرواز-فرودگاه-بوشهر"},
        {"name": "فرودگاه بندرعباس", "url": "/117/اطلاعات-پرواز-فرودگاه-بندرعباس"},
        {"name": "فرودگاه کرمان", "url": "/201/اطلاعات-پرواز-فرودگاه-کرمان"},
        {"name": "فرودگاه ساري", "url": "/106/اطلاعات-پرواز-فرودگاه-ساري"},
        {"name": "فرودگاه يزد", "url": "/107/اطلاعات-پرواز-فرودگاه-يزد"},
        {"name": "فرودگاه اروميه", "url": "/110/اطلاعات-پرواز-فرودگاه-اروميه"},
        {"name": "فرودگاه کرمانشاه", "url": "/111/اطلاعات-پرواز-فرودگاه-کرمانشاه"},
        {"name": "فرودگاه رشت", "url": "/203/اطلاعات-پرواز-فرودگاه-رشت"},
        {"name": "فرودگاه زاهدان", "url": "/109/اطلاعات-پرواز-فرودگاه-زاهدان"},
        {"name": "فرودگاه آبادان", "url": "/301/اطلاعات-پرواز-فرودگاه-آبادان"},
        {"name": "فرودگاه گرگان", "url": "/202/اطلاعات-پرواز-فرودگاه-گرگان"},
        {"name": "فرودگاه همدان", "url": "/112/اطلاعات-پرواز-فرودگاه-همدان"},
        {"name": "فرودگاه اردبيل", "url": "/113/اطلاعات-پرواز-فرودگاه-اردبيل"},
        {"name": "فرودگاه ايلام", "url": "/105/اطلاعات-پرواز-فرودگاه-ايلام"},
        {"name": "فرودگاه بيرجند", "url": "/204/اطلاعات-پرواز-فرودگاه-بيرجند"},
        {"name": "فرودگاه سنندج", "url": "/402/اطلاعات-پرواز-فرودگاه-سنندج"},
        {"name": "فرودگاه شهرکرد", "url": "/108/اطلاعات-پرواز-فرودگاه-شهرکرد"},
        {"name": "فرودگاه بجنورد", "url": "/901/اطلاعات-پرواز-فرودگاه-بجنورد"},
        {"name": "فرودگاه لارستان", "url": "/601/اطلاعات-پرواز-فرودگاه-لارستان"},
        {"name": "فرودگاه خرم آباد", "url": "/701/اطلاعات-پرواز-فرودگاه-خرم-آباد"},
        {"name": "فرودگاه پارس آبادمغان", "url": "/702/اطلاعات-پرواز-فرودگاه-پارس-آبادمغان"},
        {"name": "فرودگاه سمنان", "url": "/801/اطلاعات-پرواز-فرودگاه-سمنان"},
        {"name": "فرودگاه شاهرود", "url": "/802/اطلاعات-پرواز-فرودگاه-شاهرود"},
        {"name": "فرودگاه نوشهر", "url": "/1201/اطلاعات-پرواز-فرودگاه-نوشهر"},
        {"name": "فرودگاه ياسوج", "url": "/1001/اطلاعات-پرواز-فرودگاه-ياسوج"},
        {"name": "فرودگاه زنجان", "url": "/501/اطلاعات-پرواز-فرودگاه-زنجان"},
        {"name": "فرودگاه اراک", "url": "/1401/اطلاعات-پرواز-فرودگاه-اراک"},
        {"name": "فرودگاه زابل", "url": "/1501/اطلاعات-پرواز-فرودگاه-زابل"}
    ]

    # Flight table IDs mapping
    FLIGHT_TABLE_IDS = {
        "input": "Domestic Arrival",
        "output": "Domestic Departure",
        "internal": "International Arrival",
        "external": "International Departure"
    }